
{
    "entries": "texts_from_reddit",
    "examples":
    [
        "Thinking about hospitalization but terrified. I don't know what to do. I lie in bed all day and I can't get myself to do anything, and I feel like I'm close to suicide. But I'm terrified of going to a hospital. I have medicaid and the only hospital in my county that accepts it is kind of a shitty hospital. I'm kind of afraid of hospitals to begin with so it doesn't help. I have an image in my head of going to a crowded dirty ward and being forgotten, or being given shitty medication that isn't right for me. A friend of mine was hospitalized once on a 72 hour hold, and she ended up sleeping on a gurney in a hallway the whole time (different hospital). I don't want to be in a strange place with strange people. I already feel alone and defective and I feel like being in a hospital will just make me feel like even more of a fuck up. I need help, but I don't know what the right step is. I'm meeting with my school therapist tomorrow to talk through some options, but I guess I'm posting because I wanted to have some ideas when I talk to her.",
        "its an inconvenient time to be suicidal TW. last night I tried to kill myself by tying my shoe lace around this hook on my ceiling, now I'm 110 pounds and thought I might give it a try. well, I put scissors in my pocket just in case I changed my mind in the middle of choking. so I put my neck around the noose and leaned off my bed. I could feel the shoe lace getting tighter around my neck until I finally stepped off my bed and I hung there choking for 5 seconds until the hook gave out and I fell back onto my bed. for about an hour the shoe lace was still tight around my neck and I was debating whether to cut it or not. well, I did then cut my wrist to ribbons, more then I ever have before. now this all took place at 1am, so I was tired from crying and decided to sleep. woke up, and realized I need to tell someone because I'm scared I will do it again. seriously the only thing keeping me alive is my mom and step dad. but we currently don't have insurance as my mom started a new job recently and I know I have to be hospitalized again. I'm really not sure what to do, should I tell someone, go through with it, or just leave it be and hope it doesn't happen again? sorry I'm kinda panicked right now so this might not make any sense",
        "Feel like i'm hanging on a thread. I'm really trying to keep going but I just can't love the person I am today. I seem to ruin my relationships and now I just don't know how to fix anything and I'd just rather die honestly. I don't know why I posted, sorry for wasting space.",
        "Highly suicidal and I have no idea what to do. I don't even know why I'm posting here. I'm planning on killing myself in the next week. I've spent the better part of two years daydreaming about it almost constantly. I feel like all the things that have kept me from taking my own life, my self-pity and emotion, they're all gone and my options are running out and I'm just so tired. I'm supposed to be a programmer. I've been searching for a job for months—years, really. I can't seem to find work. I've applied to hundreds of places. I've watched the friends who would call me up for coding advice land their first jobs, their second jobs, and on and on. I started shutting them out of my life because it hurts so much to get a call asking about how to solve a problem or do something in some programming language but not being able to find a job myself. Hundreds of applications and a dozen or so interviews later, I'm losing my optimism about ever finding work in my industry. So months ago I started applying to bars and restaurants around my city. They're all looking for 'experience.' I've applied to several drugstores like CVS, some fast food places, Starbucks, and Apple. I put time even into these applications. I haven't gotten a call back. I'm so depressed I can hardly even bring myself to look at job listings in the past few weeks. The memory of all the rejection makes my heart jump into my throat. I'm not on any medication and I have no idea if some pharmaceutical would chill me out enough to just trudge forward because I don't have health insurance and there's no way I can afford to see anyone. I don't understand. I'm not un-personable and I'm not dumb. I do my best to be kind. I try to act happy-go-lucky, and I like making people laugh. I've always enjoyed talking to people, and I always thought they enjoyed talking to me. I've felt that the few interviews I've gotten went well. But I'm even starting to question that. I feel like I'm the butt of some cosmic joke designed to see how long someone just striving to work and be productive in society can countenance being denied that dignity before calling it all off. I love the people in my life. My girlfriend is very sweet. I love my dog. But I can't bear to tell her I'm not going to be able to make rent again this month or that I can't afford tickets to our friends' wedding. I can't keep repeating the same sad story about not being able to find work. I'm sick of waking up with a 'grind-it-and-you'll-find-it' attitude, of hearing my friends and family talk about how perseverance pays off, and somehow still failing every single time. I just want a fucking job. Any job. I'm about to miss my student loan payment and the credit score I've spent years maintaining is going to go down the tubes. How do I explain to my girlfriend months from now that I can't apply for housing with her because my credit score is ruined? I'm tired. So tired. I can't even cry. I think I give up. I know this is probably tantamount to me screaming in the void, but I can't exactly tell her what I'm planning on doing, and she's already stressed out enough dealing with her own problems that I just don't want to pile them on top. To anyone who made it this far, thanks.",
        "Might have to start over in a new town, any suggestions on how to kill myself? On Monday my school is going to contact me to let me know if I’m being expelled or not. If I am being expelled I would have to start over in a new town, I honestly can’t fucking do that. I finally found a friend group, I’m getting on top of my grades and my life. I can’t abandon all of that and start over again. I probably wouldn’t even be able to get into college. Anyways so on Monday, or at some point that week I will kill myself after I get the result of my expulsion hearing. I live in Massachusetts, around the Boston area, I’m just telling you that to help anyone give me advice. I think jumping in front of a train would be pretty good but I’m in the middle of suburbia so there aren’t that many trains around, but maybe I could get into another town with a subway or some shit. I know ODing and slitting wrists almost never works so I’m probably not gonna try that. I don’t know how high I’d have to fall from to actually die but if anyone knows measurements or statistics I’d like to see them. And any suggestions of a fairly painless way to off myself would be appreciated.",
        "Does anyone else experience urges of feeling you need to tell someone you're suicidal? There's times I get an overwhelming pull to tell someone, anyone, how I'm feeling. I already tell my partner a lot of my thoughts, but as they also have depression (not suicidal though), I've been worrying that I've been making them feel worse lately. Unfortunately, telling my family isn't an option. I have a few friends, but only one I feel like I could actually tell. Does anyone else feel like this sometimes?",
        "Does anyone want to join me? I have my plan which I’ve thought a lot about. I have a way to do it that will simultaneously dispose of my body so there is no cleanup for those left behind. I recently sorted through my belongings so that will be easy for who is left behind to sift through. March 7 is the day. My partner recently acted so abusive towards me that I realized that was the final push I needed. I’m ready to go. I’ve thought about this for a long time and sought lots of treatment to no avail. I would rather die than rejoin society. I am 90% catatonic and I don’t think it’s fair to ask my family and friends to continue caring for me. I feel like I have seen what everyone else saw in the movie Bird Box and there is a deep emptiness inside of me that can’t be fixed. Let me know if you’d like to join. Sometimes suicide is the kindest option and life is worse than death.",
        "Somebody please talk to me. I can't handle this anymore, i get closer and closer every day. I self harmed for the first time today. The loneliness is killing me.",
        "I reached out in school and they sent me to crisis center for 24 hours without my will. This happened back in January when I was really depressed because the usual, having no hope in anything but now that I changed schools ,I got new friends and a boyfriend!! It was on a Wednesday I think? I was writing my suicide note in 5am in the morning preparing my last day of life. I walk to school and went to gym where I started to cry and laugh at the same time because I realized that people are going to milk my death for their attention. My teacher didn't care and sent CA or whatever that means to 'talk to someone'. At that point when I was walking to the office I said it 'I don't want to live anymore'. I was hopefully thinking that I was getting help I was sent to the school therapist and talk to someone basically they 'talk to me' and told me if it was a thought or a plan. I said it was a plan and then they *said that I had the drugs in my backpack*.they quickly called a ambulance to get me out of there and put me there without my will The crisis center was terrible. They fucking nurse talked shit about you and blame things on you.'ya ever think it was your fault people don't talk to you' type of stuff. I was crying and sleeping the whole time until it was 1pm the next day. The fall out was horrible,My mom didn't trust me anymore to myself and people made rumors about me. I never tried to talk to anyone about my problems expect my therapist. I won't reach out to my friends or hotline because I can't trust them that I'm going to same place that was going to make me worse. Sorry about this rant, I just need to talk about it I guess",
        "First-time thoughts, I just don't want to live. This is something that I have never experienced in the past, and I'm just struggling to find my way through it. I've been having intrusive thoughts about how sucky everything is, and how life isn't really even worth living. It feels fake to me, like it's all just some sort of game. Dying seems way more desirable than living with my parents never agreeing with any of my decisions/desires, not having any close friends, or any friends that are actually there for me in times of need. Not having any friends that enjoy hanging out with me, or associating with me makes me realize that I'm probably the toxic one in a way that I don't completely understand. I feel like all of the ways I process things are completely narcissistic and selfish. I can't seem to change that. It if I can't change me being narcissistic then I will never really have anyone who would want to associate with me, understandably, then what's the point. Whenever I try to 'do the right thing' as said by my parents, I just get extremely depressed. I enjoy smoking weed and nicotine and drinking, but my parents disagree with it. I know I can obviously do what I choose to do, but with them starting to so heavily opposing it since they found out, I find it hard to partake in the activities. But when I'm not doing anything that I consider 'fun', then I feel like I'm just drowning in my own 'life'. I don't want to live it anymore. I can go through living it, but I just can't really find true satisfaction with anything, which to me doesn't seem like it's worth living. If I'm always going to be drowning in sorrow, then living a shitty life doesn't seem worth it. I'd like to get better, but I just can't do it.",
        "Ugly as sin, only one job before 25, wish I could end it. I just turned 25 and I only got my first job at 24, I've been at university for ages it seems. Even when I graduate they will just look at my employment history and laugh. I feel absolutely pathetic. Everyone from high school has their career going and I'm still sitting here at university wandering aimlessly with my baby face and 0 friends. If it weren't for my brother and parents I would have ended things a long time ago. I wish I were never born. I can't end my life because it would break the hearts of my family, but I'm living in pain.",
        "How do i get help. I am feeling the worst I’ve ever felt but I still want to get better. I don’t want to go to a therapist. I don’t want to go to the hotline out of fear for it showing up on a phone bill or them calling the police or something. I don’t want to talk to any friends as to not stress them out or seem like its a big deal or I’m being attention whore. Any suggestions? Please. Thanks.",
        "I need some help please. I have had suicidal thoughts for years. They ruin my day, and I feel they make a self fulfilling prophecy of sorts as they make me feel hopeless and unmotivated, making my feelings of having no future worse. I don’t have any friends. I don’t think I have never been close to anyone, including my immediate family while they were still around. I’m terribly socially inept, and no matter how prepared I try to be and make my best effort to make good first impressions, I fail and end up falling into my rut eventually. I have constant suicidal thoughts all day, and have had serious contemplations close to a dozen times now. I feel I need help. Do any of you have any advice?",
        "I'm tired. It's been a year since she died. I found the love of my life and she fucking died in my arms. Every day has been the same since, and time has such little meaning that it may as well have happened yesterday. My best friend. A life full of potential, and then.... gone. I'm so tired of other's happiness being dependent on my successful wading of this shit show, but I can't die either. And I don't want to, I can't add any more pain to her memory. But I just can't stop thinking.",
        "Truly, I think there's only one option. My life isn't worth living. There's too much problems, and some I don't have answers, like I think I could be trans, but I'm not sure, and I'm scared to do anything. I don't know what to do. The more negative trans stuff I see, the more scared I get, especially detransition stories, and r/gendercritical post. There's just too much wrong with me, that I just can't fix. There's one way I can fix it... Suicide...",
        "I don't know what's going on. I was feeling sad per usual so I took 11 of my anti depressants and a handful of other pills. I keep shaking and spazing. I don't know what's going on. Oh well",
        "chronic. Sorry if this is the wrong place for this kind of rant.For as long as 15 years I didn't want to live cause living means to be someone i simply am not.I tried to suffocate myself ,i know,pretty pathetic. Cause i am to afraid of the pain and unknown which dying is, i chose the next best thing: to isolate as much as possible and search online for soulmates.Turns out I am too incompatible with nearly anyone cause of awkwardness,social anxiety and overall low social energy due to ptsd and/or autism.In an attempt of hope to get help i tried to get diagnosed but i was send away with adresses for social therapy etc which i am unable to attain.Now my life just contains of forcing myself just to survive.I had a 'relationship' to a man, which i let go on for far to long,seeing now how emotional unavailable he is.Relationships are like drugs and i dont know how close or distant is good for me to feel to someone without getting obsessed or hurting them or me.Anyway now i don't have to worry about that anymore.Just have to stay away from people and find joy in myself and hobbies i guess.Occasionally there is still this longing for 'finding my people' but my attempts fail.It's like there is a wall between me and the world,which nobody can see.Constantly hitting this wall is so goddamn exhausting.I don't know, i just want to feel normal and save i guess but today,it seems extremly out of reach again.I want to learn to love this wall now.Maybe it is here to protect me.",
        "I just want to die. I'm tired of being me, I'm tired of living, I'm tired of struggling with depression, I'm tired of struggling with severe social anxiety, I'm tired of being so codependent, I'm tired of feeling so worthless and alone, I'm tired of feeling so unwanted, I'm tired of being a burden to people, I'm tired of pushing people away, I'm tired of my codependency ruining the best thing that ever happened to me, I'm tired of knowing that I'll always be a failure in life and never amount to anything, I'm tired of my dad treating me like I'm a child, I'm tired of feeling like a prisoner in my own room, I'm tired of being the most pathetic human being on the planet! I'm a 20 year old male, who has done shit with his life since finishing high school and has never worked a day in his life. I have very little life skills. I don't even have my ID or my drivers license yet. My social anxiety makes interacting with people and making friends damn near impossible, it makes even the most trivial shit like interacting with someone at a register difficult. I'm just so fucking tired of my mind. I'm tired of everything!!! I'm tired of pushing myself to live for other people, I'm tired of people telling me I'm young and have my whole life ahead of me. I don't want to fucking live a life of loneliness. I'm slowly pushing away the person I love with all my heart, because I'm so fucking codependent and mentally ill/unstable. She used to love me with all her heart and I was the world to her, but now half the time she's not sure if she still loves me. She's the world to me, and the only friend I really have left, and I feel like I'm slowly losing her/pushing her away. Earlier this year, I was alone for 6 months straight, consumed by loneliness and depression and guilt (that's another story).... But then she came into my life, and made me so happy. But like any good thing that happens to me, I'm managing to fuck it up, and my codependency is slowly pushing her away. I'm tired of this loneliness. I'm tired of feeling like the light is slipping from my life and soon I'll be back in darkness. I'm thinking about attempting to OD tonight, so I'll no longer be a burden to people I care about/love :( I just don't know what to do anymore, she's the main thing keeping me going. She makes/made me happier than anyone else ever has... and I feel like i'm losing her :(",
        "I don't know who to reach out to without upsetting or worrying anyone. I think about suicide a lot but not enough to make plans, but now it's been in my head for so long it's making me physically ill and I'm planning a lot more. I'm scared it won't work and I will have to face life with everyone knowing what I did and being concerned. But from this I can't commit to it and have no idea who to tell to ask for help. I can't use the phone and I hate talking about anything. Opening up is not possible for me. But I want help.",
        "Endless Despair. I can't find a reason not to hang myself. There's nothing for me here and it hurts so unbelievably much to see everybody else living a normal life while I'm... well... me. It makes me so sick with envy I just want to throw up. I want love, support, understanding, and friendship but I don't think I'll ever find them. I never really have and after two decades I don't have think I ever truly will. I want to be free."

    ]
}